tap "1password/tap"
tap "cantino/mcfly"
tap "eth-p/software"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lencx/nofwl"
tap "microsoft/git"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "yt-dlp/taps"
brew "act"
brew "apr-util"
brew "bash"
brew "bat"
brew "berkeley-db", link: true
brew "broot"
brew "harfbuzz"
brew "chafa"
brew "cmake"
brew "sqlite"
brew "cookiecutter"
brew "openldap"
brew "curl"
brew "delve"
brew "docker"
brew "docker-compose"
brew "dust"
brew "duti"
brew "node"
brew "eslint"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "mpg123"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "gd"
brew "gh"
brew "git"
brew "go"
brew "hunspell"
brew "imagemagick"
brew "jq"
brew "just"
brew "krb5"
brew "mcfly"
brew "pandoc"
brew "parallel"
brew "perl"
brew "php"
brew "pipx"
brew "pnpm"
brew "powerlevel10k"
brew "prettier"
brew "pybind11"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "trash"
brew "tree"
brew "typescript"
brew "unzip"
brew "virtualenv"
brew "vite"
brew "yt-dlp"
brew "zsh"
brew "zsh-autopair"
brew "eth-p/software/bat-extras"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "backblaze"
cask "backblaze-downloader"
cask "chatgpt"
cask "drawio"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "git-credential-manager-core"
cask "google-drive"
cask "grammarly"
cask "karabiner-elements"
cask "keycastr"
cask "mactex"
cask "obsidian"
cask "pycharm"
cask "r"
cask "rstudio"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "albymor.increment-selection"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "antfu.vite"
vscode "artydeveloperduck.save-as-snippet"
vscode "betafcc.ts-reveal-types"
vscode "bierner.color-info"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-image-size"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-shiki"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.shell-syntax"
vscode "bmuskalla.vscode-tldr"
vscode "bodil.prettier-toml"
vscode "bradlc.vscode-tailwindcss"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "ChrisChinchilla.vscode-pandoc"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "cmoog.sqlnotebook"
vscode "CodeQue.codeque"
vscode "codezombiech.gitignore"
vscode "Codium.codium"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "DiogoNolasco.pyinit"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.githistory"
vscode "donjayamanne.vscode-jupytext"
vscode "DotJoshJohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "edb.settings-on-fire"
vscode "EditorConfig.EditorConfig"
vscode "emeraldwalk.RunOnSave"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "fabiospampinato.vscode-commands"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "gerane.Theme-Jellybeams"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "GregorBiswanger.json2ts"
vscode "Gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "hoovercj.vscode-settings-cycler"
vscode "IBM.output-colorizer"
vscode "idleberg.applescript"
vscode "jakearl.search-editor-apply-changes"
vscode "James-Yu.latex-workshop"
vscode "JannisX11.batch-rename-extension"
vscode "jeff-hykin.polacode-2019"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "Jeusto.warm-up-typing-test"
vscode "jmviz.quote-list"
vscode "kevinkyang.auto-comment-blocks"
vscode "KevinRose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "knowsuchagency.pdm-task-provider"
vscode "koehlma.markdown-math"
vscode "kokakiwi.vscode-just"
vscode "kortina.vscode-markdown-notes"
vscode "lewissteele.vscode-sql-lint"
vscode "lfm.vscode-makefile-term"
vscode "ludem.ludem-dark-blue"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "mkhl.shfmt"
vscode "mrmlnc.vscode-postcss-sorting"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vscode.wordcount"
vscode "nicoespeon.slides"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "notZaki.pandocciter"
vscode "Orta.vscode-twoslash-queries"
vscode "oven.bun-vscode"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "phplasma.csv-to-table"
vscode "PKief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "quarto.quarto"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "qwtel.sqlite-viewer"
vscode "rafamel.subtle-brackets"
vscode "rangav.vscode-thunder-client"
vscode "RDebugger.r-debugger"
vscode "rebornix.toggle"
vscode "REditorSupport.r"
vscode "ReneSaarsoo.sql-formatter-vsc"
vscode "richie5um2.vscode-sort-json"
vscode "rioj7.select-by"
vscode "rioj7.vscode-remove-comments"
vscode "ritwickdey.LiveServer"
vscode "rogalmic.bash-debug"
vscode "ryu1kn.edit-with-shell"
vscode "ryuta46.multi-command"
vscode "sidthesloth.html5-boilerplate"
vscode "sleistner.vscode-fileutils"
vscode "sourcegraph.cody-ai"
vscode "sourcery.sourcery"
vscode "stackbreak.comment-divider"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "stringham.move-ts"
vscode "svipas.control-snippets"
vscode "TakumiI.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
vscode "telesoho.vscode-markdown-paste-image"
vscode "thqby.vscode-autohotkey2-lsp"
vscode "TianyiShi.rmarkdown"
vscode "timonwong.shellcheck"
vscode "tonybaloney.vscode-pets"
vscode "tuxtina.json2yaml"
vscode "Tyriar.sort-lines"
vscode "uctakeoff.vscode-counter"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "VisualStudioExptTeam.vscodeintellicode-completions"
vscode "VisualStudioExptTeam.vscodeintellicode-insiders"
vscode "vscode-icons-team.vscode-icons"
vscode "vulkd.inline-sql-formatter"
vscode "w0o0o.bun-scripts"
vscode "WallabyJs.console-ninja"
vscode "WallabyJs.quokka-vscode"
vscode "WallabyJs.wallaby-vscode"
vscode "wesbos.theme-cobalt2"
vscode "wix.vscode-import-cost"
vscode "YoavBls.pretty-ts-errors"
vscode "YRM.type-challenges"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "Zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
vscode "znck.grammarly"
vscode "zokugun.explicit-folding"
