aaron-bond.better-comments
adpyke.codesnap
albymor.increment-selection
alefragnani.project-manager
alexcvzz.vscode-sqlite
antfu.vite
artydeveloperduck.save-as-snippet
betafcc.ts-reveal-types
bierner.color-info
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-image-size
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-shiki
bierner.markdown-yaml-preamble
bmalehorn.shell-syntax
bmuskalla.vscode-tldr
bodil.prettier-toml
bradlc.vscode-tailwindcss
Cardinal90.multi-cursor-case-preserve
charliermarsh.ruff
ChrisChinchilla.vscode-pandoc
christian-kohler.path-intellisense
chrmarti.regex
cmoog.sqlnotebook
CodeQue.codeque
codezombiech.gitignore
Codium.codium
darkriszty.markdown-table-prettify
dbaeumer.vscode-eslint
deerawan.vscode-dash
DiogoNolasco.pyinit
dnicolson.binary-plist
donjayamanne.githistory
donjayamanne.vscode-jupytext
DotJoshJohnson.xml
ecmel.vscode-html-css
edb.settings-on-fire
EditorConfig.EditorConfig
emeraldwalk.RunOnSave
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
eseom.nunjucks-template
fabiospampinato.vscode-commands
formulahendry.auto-close-tag
formulahendry.code-runner
gerane.Theme-Jellybeams
GitHub.codespaces
GitHub.copilot
GitHub.copilot-chat
GitHub.github-vscode-theme
GitHub.remotehub
github.vscode-github-actions
GitHub.vscode-pull-request-github
goessner.mdmath
golang.go
GregorBiswanger.json2ts
Gruntfuggly.todo-tree
hediet.vscode-drawio
hoovercj.vscode-settings-cycler
IBM.output-colorizer
idleberg.applescript
jakearl.search-editor-apply-changes
James-Yu.latex-workshop
JannisX11.batch-rename-extension
jeff-hykin.polacode-2019
jerrygoyal.shortcut-menu-bar
Jeusto.warm-up-typing-test
jmviz.quote-list
kevinkyang.auto-comment-blocks
KevinRose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
knowsuchagency.pdm-task-provider
koehlma.markdown-math
kokakiwi.vscode-just
kortina.vscode-markdown-notes
lewissteele.vscode-sql-lint
lfm.vscode-makefile-term
ludem.ludem-dark-blue
mads-hartmann.bash-ide-vscode
mdickin.markdown-shortcuts
mechatroner.rainbow-csv
meganrogge.template-string-converter
mgesbert.python-path
mhutchie.git-graph
michelemelluso.gitignore
mikestead.dotenv
mintlify.document
mkhl.shfmt
mrmlnc.vscode-postcss-sorting
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.gather
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.test-adapter-converter
ms-vscode.vscode-github-issue-notebooks
ms-vscode.vscode-typescript-next
ms-vscode.wordcount
nicoespeon.slides
njpwerner.autodocstring
njqdev.vscode-python-typehint
notZaki.pandocciter
Orta.vscode-twoslash-queries
oven.bun-vscode
patbenatar.advanced-new-file
pflannery.vscode-versionlens
phplasma.csv-to-table
pmneo.tsimporter
quarto.quarto
qufiwefefwoyn.inline-sql-syntax
qwtel.sqlite-viewer
rafamel.subtle-brackets
rangav.vscode-thunder-client
RDebugger.r-debugger
rebornix.toggle
REditorSupport.r
ReneSaarsoo.sql-formatter-vsc
richie5um2.vscode-sort-json
rioj7.select-by
rioj7.vscode-remove-comments
ritwickdey.LiveServer
rogalmic.bash-debug
ryu1kn.edit-with-shell
ryuta46.multi-command
sidthesloth.html5-boilerplate
sleistner.vscode-fileutils
sourcegraph.cody-ai
sourcery.sourcery
stackbreak.comment-divider
stkb.rewrap
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-german
stringham.move-ts
svipas.control-snippets
TakumiI.markdowntable
tamasfe.even-better-toml
tecosaur.latex-utilities
telesoho.vscode-markdown-paste-image
thqby.vscode-autohotkey2-lsp
TianyiShi.rmarkdown
timonwong.shellcheck
tonybaloney.vscode-pets
tuxtina.json2yaml
Tyriar.sort-lines
uctakeoff.vscode-counter
usernamehw.errorlens
vincaslt.highlight-matching-tag
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
VisualStudioExptTeam.vscodeintellicode-completions
VisualStudioExptTeam.vscodeintellicode-insiders
vscode-icons-team.vscode-icons
vulkd.inline-sql-formatter
w0o0o.bun-scripts
WallabyJs.console-ninja
WallabyJs.quokka-vscode
WallabyJs.wallaby-vscode
wesbos.theme-cobalt2
wix.vscode-import-cost
YoavBls.pretty-ts-errors
YRM.type-challenges
yy0931.vscode-sqlite3-editor
yzane.markdown-pdf
yzhang.markdown-all-in-one
Zignd.html-css-class-completion
ziyasal.vscode-open-in-github
znck.grammarly
zokugun.explicit-folding
