a-h.templ
aaron-bond.better-comments
adpyke.codesnap
adrianwilczynski.alpine-js-intellisense
albymor.increment-selection
alefragnani.project-manager
alexcvzz.vscode-sqlite
altimateai.vscode-altimate-mcp-server
antfu.vite
artydeveloperduck.save-as-snippet
astro-build.astro-vscode
betafcc.ts-reveal-types
bierner.color-info
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-image-size
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-shiki
bierner.markdown-yaml-preamble
biomejs.biome
bmalehorn.shell-syntax
bmuskalla.vscode-tldr
bodil.prettier-toml
bradlc.vscode-tailwindcss
bruno-api-client.bruno
cardinal90.multi-cursor-case-preserve
charliermarsh.ruff
chrischinchilla.vscode-pandoc
christian-kohler.path-intellisense
chrmarti.regex
cmoog.sqlnotebook
codeque.codeque
codezombiech.gitignore
codium.codium
cweijan.dbclient-jdbc
cweijan.duckdb-packs
cweijan.vscode-database-client2
cweijan.vscode-mysql-client2
cweijan.vscode-redis-client
darkriszty.markdown-table-prettify
dbaeumer.vscode-eslint
deerawan.vscode-dash
diogonolasco.pyinit
dnicolson.binary-plist
docker.docker
donjayamanne.githistory
donjayamanne.vscode-jupytext
dorzey.vscode-sqlfluff
dotjoshjohnson.xml
ecmel.vscode-html-css
edb.settings-on-fire
editorconfig.editorconfig
eliostruyf.vscode-front-matter
emeraldwalk.runonsave
emmanuelbeziat.vscode-great-icons
eriklynd.json-tools
esbenp.prettier-vscode
eseom.nunjucks-template
evidence.evidence-vscode
evidence.sqltools-duckdb-driver
fabiospampinato.vscode-commands
formulahendry.auto-close-tag
formulahendry.code-runner
gerane.theme-jellybeams
github.codespaces
github.copilot
github.copilot-chat
github.github-vscode-theme
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
goessner.mdmath
golang.go
gregorbiswanger.json2ts
gruntfuggly.todo-tree
hashicorp.terraform
hediet.vscode-drawio
hoovercj.vscode-settings-cycler
ibm.output-colorizer
idleberg.applescript
innoverio.vscode-dbt-power-user
jakearl.search-editor-apply-changes
james-yu.latex-workshop
jannisx11.batch-rename-extension
jeff-hykin.polacode-2019
jerrygoyal.shortcut-menu-bar
jetmartin.bats
jeusto.warm-up-typing-test
jjjermiah.pixi-vscode
jmviz.quote-list
kevinkyang.auto-comment-blocks
kevinrose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
knowsuchagency.pdm-task-provider
koehlma.markdown-math
kokakiwi.vscode-just
kortina.vscode-markdown-notes
lewissteele.vscode-sql-lint
lfm.vscode-makefile-term
ludem.ludem-dark-blue
mads-hartmann.bash-ide-vscode
mdickin.markdown-shortcuts
mechatroner.rainbow-csv
meganrogge.template-string-converter
mgesbert.python-path
mhutchie.git-graph
michelemelluso.gitignore
mikestead.dotenv
mintlify.document
mkhl.shfmt
mrmlnc.vscode-postcss-sorting
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.gather
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.test-adapter-converter
ms-vscode.vscode-github-issue-notebooks
ms-vscode.vscode-typescript-next
ms-vscode.wordcount
mtxr.sqltools
nicoespeon.slides
njpwerner.autodocstring
njqdev.vscode-python-typehint
notzaki.pandocciter
orta.vscode-twoslash-queries
otovo-oss.htmx-tags
oven.bun-vscode
passioinc.go-inline-pgformatter
patbenatar.advanced-new-file
pflannery.vscode-versionlens
phplasma.csv-to-table
pkief.material-icon-theme
pmneo.tsimporter
pomdtr.excalidraw-editor
quarto.quarto
quary.sqruff
qufiwefefwoyn.inline-sql-syntax
qwtel.sqlite-viewer
rafamel.subtle-brackets
randomfractalsinc.duckdb-sql-tools
rangav.vscode-thunder-client
rdebugger.r-debugger
rebornix.toggle
redhat.vscode-yaml
redis.redis-for-vscode
reditorsupport.r
renesaarsoo.sql-formatter-vsc
richie5um2.vscode-sort-json
rioj7.select-by
rioj7.vscode-remove-comments
ritwickdey.liveserver
rogalmic.bash-debug
ryu1kn.edit-with-shell
ryuta46.multi-command
samuelcolvin.jinjahtml
sidthesloth.html5-boilerplate
sleistner.vscode-fileutils
sourcegraph.cody-ai
sourcery.sourcery
sperovita.alpinejs-syntax-highlight
stackbreak.comment-divider
stkb.rewrap
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-german
stringham.move-ts
svelte.svelte-vscode
svipas.control-snippets
takumii.markdowntable
tamasfe.even-better-toml
tecosaur.latex-utilities
telesoho.vscode-markdown-paste-image
thqby.vscode-autohotkey2-lsp
tianyishi.rmarkdown
timonwong.shellcheck
tonybaloney.vscode-pets
tuxtina.json2yaml
tyriar.sort-lines
uctakeoff.vscode-counter
usernamehw.errorlens
vincaslt.highlight-matching-tag
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
visualstudioexptteam.vscodeintellicode-completions
visualstudioexptteam.vscodeintellicode-insiders
vscode-icons-team.vscode-icons
w0o0o.bun-scripts
wallabyjs.console-ninja
wallabyjs.quokka-vscode
wallabyjs.wallaby-vscode
wesbos.theme-cobalt2
wix.vscode-import-cost
yoavbls.pretty-ts-errors
yrm.type-challenges
yy0931.vscode-sqlite3-editor
yzane.markdown-pdf
yzhang.markdown-all-in-one
zignd.html-css-class-completion
ziyasal.vscode-open-in-github
znck.grammarly
zokugun.explicit-folding
