tap "1password/tap"
tap "cantino/mcfly"
tap "eth-p/software"
tap "heroku/brew"
tap "homebrew/bundle"
tap "kaos/shell"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lencx/nofwl"
tap "microsoft/git"
tap "oven-sh/bun"
tap "quarylabs/quary"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
tap "yt-dlp/taps"
# Run your GitHub Actions locally
brew "act"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Bash Automated Testing System
brew "bats-core"
# Toolchain of the web
brew "biome"
# New way to see and navigate directory trees
brew "broot"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# Diff your Docker containers
brew "container-diff"
# Command-line interface for SQLite
brew "sqlite"
# Utility that creates projects from templates
brew "cookiecutter"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Debugger for the Go programming language
brew "delve"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Isolated development environments using Docker
brew "docker-compose"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Spell checker and morphological analyzer
brew "hunspell"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Duplicate file finder and an enhanced fork of 'fdupes'
brew "jdupes"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Open-source distributed event streaming platform
brew "kafka"
# Kubernetes command-line interface
brew "kubernetes-cli"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Run a Kubernetes cluster locally
brew "minikube"
# Powerful paging program
brew "most"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Package management made easy
brew "pixi"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Service monitoring system and time series database
brew "prometheus"
# Seamless operability between C++11 and Python
brew "pybind11"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli", link: false
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# SQL formatter with width-aware output
brew "sqlfmt"
# CLI utility for manipulating SQLite databases
brew "sqlite-utils"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Next generation frontend tooling. It's fast!
brew "vite"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Auto-close and delete matching delimiters in zsh
brew "zsh-autopair"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Data backup and storage service
cask "backblaze"
# Download Backblaze restored files more reliably
cask "backblaze-downloader"
# Menu bar icon organiser
cask "bartender"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
# Client for the Google Drive storage service
cask "google-drive"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Adaptive brightness for external displays
cask "lunar"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Digital note taking app
cask "microsoft-onenote"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
# Desktop syncing client for ownCloud
cask "owncloud"
# IDE for professional Python development
cask "pycharm"
# Environment for statistical computing and graphics
cask "r-app"
# Data science software focusing on R and Python
cask "rstudio"
# Open-source code editor
cask "visual-studio-code"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdBlock Pro", id: 1018301773
mas "AdGuard Mini", id: 1440147259
mas "Amphetamine", id: 937984704
mas "ChronoSync Express", id: 904801687
mas "Color Picker", id: 1545870783
mas "Data Jar", id: 1453273600
mas "Drafts", id: 1435957248
mas "Goodnotes", id: 1444383602
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFgear", id: 1615523079
mas "Peek", id: 1554235898
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Smart Converter", id: 447513724
mas "Speedtest", id: 1153157709
mas "TextSniper", id: 1528890965
mas "Velja", id: 1607635845
mas "Yoink", id: 457622435
vscode "a-h.templ"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adrianwilczynski.alpine-js-intellisense"
vscode "albymor.increment-selection"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "artydeveloperduck.save-as-snippet"
vscode "astral-sh.ty"
vscode "astro-build.astro-vscode"
vscode "betafcc.ts-reveal-types"
vscode "bierner.color-info"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-image-size"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-shiki"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bmalehorn.shell-syntax"
vscode "bmuskalla.vscode-tldr"
vscode "bodil.prettier-toml"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "cmoog.sqlnotebook"
vscode "codeque.codeque"
vscode "codezombiech.gitignore"
vscode "codium.codium"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.duckdb-packs"
vscode "cweijan.vscode-database-client2"
vscode "cweijan.vscode-mysql-client2"
vscode "cweijan.vscode-redis-client"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "diogonolasco.pyinit"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.vscode-jupytext"
vscode "dorzey.vscode-sqlfluff"
vscode "dotjoshjohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "edb.settings-on-fire"
vscode "editorconfig.editorconfig"
vscode "eliostruyf.vscode-front-matter"
vscode "emeraldwalk.runonsave"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "evidence.evidence-vscode"
vscode "evidence.sqltools-duckdb-driver"
vscode "fabiospampinato.vscode-commands"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "gerane.theme-jellybeams"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "gregorbiswanger.json2ts"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "hoovercj.vscode-settings-cycler"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "idleberg.jxa"
vscode "innoverio.vscode-dbt-power-user"
vscode "jakearl.search-editor-apply-changes"
vscode "james-yu.latex-workshop"
vscode "jannisx11.batch-rename-extension"
vscode "jeff-hykin.polacode-2019"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "jetmartin.bats"
vscode "jeusto.warm-up-typing-test"
vscode "jjjermiah.pixi-vscode"
vscode "jmviz.quote-list"
vscode "kevinkyang.auto-comment-blocks"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "knowsuchagency.pdm-task-provider"
vscode "koehlma.markdown-math"
vscode "kokakiwi.vscode-just"
vscode "kortina.vscode-markdown-notes"
vscode "lewissteele.vscode-sql-lint"
vscode "lfm.vscode-makefile-term"
vscode "ludem.ludem-dark-blue"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "mkhl.shfmt"
vscode "mrmlnc.vscode-postcss-sorting"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vscode.wordcount"
vscode "mtxr.sqltools"
vscode "nicoespeon.slides"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "notzaki.pandocciter"
vscode "openai.chatgpt"
vscode "orta.vscode-twoslash-queries"
vscode "otovo-oss.htmx-tags"
vscode "oven.bun-vscode"
vscode "passioinc.go-inline-pgformatter"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "phplasma.csv-to-table"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "pomdtr.excalidraw-editor"
vscode "quarto.quarto"
vscode "quary.sqruff"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "qwtel.sqlite-viewer"
vscode "rafamel.subtle-brackets"
vscode "randomfractalsinc.duckdb-sql-tools"
vscode "rangav.vscode-thunder-client"
vscode "rdebugger.r-debugger"
vscode "rebornix.toggle"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "richie5um2.vscode-sort-json"
vscode "rioj7.select-by"
vscode "rioj7.vscode-remove-comments"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "ryu1kn.edit-with-shell"
vscode "ryuta46.multi-command"
vscode "samuelcolvin.jinjahtml"
vscode "sidthesloth.html5-boilerplate"
vscode "sleistner.vscode-fileutils"
vscode "sourcegraph.cody-ai"
vscode "sourcery.sourcery"
vscode "sperovita.alpinejs-syntax-highlight"
vscode "sqlfluff.vscode-sqlfluff"
vscode "stackbreak.comment-divider"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "stringham.move-ts"
vscode "svelte.svelte-vscode"
vscode "svipas.control-snippets"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
vscode "telesoho.vscode-markdown-paste-image"
vscode "thqby.vscode-autohotkey2-lsp"
vscode "tianyishi.rmarkdown"
vscode "timonwong.shellcheck"
vscode "tonybaloney.vscode-pets"
vscode "tuxtina.json2yaml"
vscode "tyriar.sort-lines"
vscode "uctakeoff.vscode-counter"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "w0o0o.bun-scripts"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wesbos.theme-cobalt2"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yrm.type-challenges"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
vscode "znck.grammarly"
vscode "zokugun.explicit-folding"
go "github.com/cosmtrek/air"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "golang.org/x/tools/gopls"
go "gotest.tools/gotestsum"
go "github.com/mitranim/gow"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
go "github.com/bokwoon95/wgo"
npm "tsx"
npm "typescript"
