[
  "advanced-cursors",
  "advanced-toolbar",
  "better-word-count",
  "cm-editor-syntax-highlight-obsidian",
  "cmdr",
  "code-block-copy",
  "copy-note",
  "darlal-switcher-plus",
  "dataview",
  "embed-code-file",
  "find-unlinked-files",
  "heycalmdown-navigate-cursor-history",
  "hotkey-helper",
  "multi-column-markdown",
  "nldates-obsidian",
  "number-headings-obsidian",
  "obsidian-advanced-new-file",
  "obsidian-advanced-uri",
  "obsidian-better-command-palette",
  "obsidian-copy-block-link",
  "obsidian-editor-shortcuts",
  "obsidian-file-link",
  "obsidian-filename-heading-sync",
  "obsidian-hider",
  "obsidian-icon-folder",
  "obsidian-icons-plugin",
  "obsidian-linter",
  "obsidian-minimal-settings",
  "obsidian-pandoc",
  "obsidian-plugin-prettier",
  "obsidian-plugin-toc",
  "obsidian-reading-time",
  "obsidian-smarter-md-hotkeys",
  "obsidian-snippet-downloader",
  "obsidian-style-settings",
  "obsidian-table-to-csv-exporter",
  "obsidian-vault-statistics-plugin",
  "periodic-notes",
  "readwise-official",
  "remember-cursor-position",
  "settings-search",
  "simple-embeds",
  "table-editor-obsidian",
  "templater-obsidian"
]